{
  "catalog": {
    "uuid": "52a34a53-69fb-4602-8e30-6809ea8d5e69",
    "metadata": {
      "title": "Generic catalog created by trestle named mobile-app-security-standard.",
      "last-modified": "2025-03-24T16:37:55.374243+08:00",
      "version": "0.0.0",
      "oscal-version": "1.1.3"
    },
    "groups": [
      {
				"id": "authn",
				"title": "Authentication",
				"parts": [
					{
						"name": "overview",
						"prose": "Apps often have user accounts that users can log into to access personalised data, make transactions, manage personal finances and perform other actions on user information and resources. However, since these digital accounts provide access to sensitive data and finances, attackers constantly attempt to gain unauthorised access by stealing credentials and impersonating users.\n\nControls in authentication ensure the  authenticity of users and the confidentiality, integrity and privacy of sensitive data. This involves employing multiple layers of authentication, including inherence-, possession- and knowledge-based factors, to validate user identity. Additionally, the controls secure user sessions and authentication processes."
					}
				],
				"controls": [
					{
						"id": "authn-bp01",
						"title": "Use multi-factor authentication (MFA)",
						"props": [
							{
								"name": "Published",
								"value": "2025-03-18T16:43:51.937000+08:00"
							},
							{
								"name": "Last-modified",
								"value": "2025-03-18T16:43:51.937000+08:00"
							},
							{
								"name": "Security-control",
								"value": "Technical, Administrative, Physical"
							},
							{
								"name": "Control-function",
								"value": "Preventive, Detective, Corrective"
							}
						],
						"parts": [
							{
								"id": "authn-bp01_stm",
								"name": "statement",
								"prose": "Traditional authentication methods typically require only a username and password, or other single-factor authentication to validate a user’s identity. However, attackers can easily bypass these authentication mechanisms by stealing credentials to impersonate the user.\n\nDevelopers should use MFA to validate users’ identity. This involves using multiple layers of identity  verification, requiring users to provide more than one type of authentication factor to verify their identity. This security control protects the authenticity of the user and the confidentiality, integrity and privacy of sensitive data"
							},
							{
								"id": "authn-bp01_gdn",
								"name": "Implementation-guidance",
								"prose": "Implement best practices, such as the following:",
								"parts": [
									{
										"name": "main-item",
										"prose": "- **Select multiple authentication methods** – Implement authentication methods from at least two of the following authentication factors:",
										"parts": [
											{
												"name": "sub-item",
												"prose": "- **Knowledge-based factors (AUTHN-BP01a)** – Knowledge-based factors, also known as “something you know”, are memorised secrets that rely on information that users remember. These factors include authentication methods such as Personal Identification Numbers (PINs) and passwords."
											},
											{
												"name": "sub-item",
												"prose": "- **Possession-based factors (AUTHN-BP01b)** – Possession-based factors, also known as “something you have”, are items that users possess. For instance, users can possess items such as a trusted hardware device, a SIM card or an email account. Users then present generated One-Time Passwords (OTPs) or cryptographic keys as proof of possession."
											},
											{
												"name": "sub-item",
												"prose": "- **Inherence-based factors (AUTHN-BP01c)** – Inherence-based factors, also known as “something you are”, are biometric identifiers that rely on users’ unique physical characteristics. These factors include authentication methods such as fingerprint, retina, facial or voice scans."
											}
										]
									},
									{
										"name": "main-item",
										"prose": "- **Use authentication methods with lower risks** – Assess the risks of account takeover through stolen credentials using the table below. Minimise these risks to prevent phishing attacks and provide higher assurance of the user’s identity.",
										"parts": [
											{
												"name": "sub-item",
												"prose": "- **Knowledge-based authentication methods**, such as passwords or passphrases, are considered highly risky because they can easily be stolen and used for account takeovers. These methods are especially vulnerable to phishing attacks, where fake websites deceive users into revealing their credentials."
											},
											{
												"name": "sub-item",
												"prose": "- **Possession-based authentication methods**",
												"parts": [
													{
														"name": "sub-sub-item",
														"prose": "- **One-time passwords (OTPs)**, such as SMS or email OTPs, are considered risky because they can be stolen and used for account takeovers. These methods are especially vulnerable to real-time phishing attacks, where fake websites deceive users into revealing their OTPs and replay them in real time."
													},
													{
														"name": "sub-sub-item",
														"prose": "- **Cryptographic keys**, such as public key infrastructure (PKI) certificates or Passkeys, are considered less risky because they are resistant to phishing. These methods are difficult to steal, as they are stored in secure elements on mobile devices."
													}
												]
											},
											{
												"name": "sub-item",
												"prose": "- **Inherence-based authentication methods**, such as fingerprint or facial verification, are considered less risky because they are resistant to phishing. These methods are difficult to steal, as they are stored in secure elements on mobile devices."
											}
										]
									},
									{
										"name": "main-item",
										"prose": "The overall MFA risk is determined by the most vulnerable authentication method used. For example, combining a password (high risk) with fingerprint verification (low risk) does not mitigate the inherent vulnerabilities of passwords, thereby undermining the effectiveness of MFA.\n\n To achieve optimal security, minimise risks across all authentication factors. For instance, using a combination of Passkeys (low risk) and facial verification (low risk) employs two phishing-resistant methods, significantly reducing the likelihood of account compromise through stolen credentials."
									}
								]
							},
							{
								"id": "authn-bp01_inf",
								"name": "Additional-notes",
								"prose": "Firstly, Single Sign-On (SSO) allows users to access multiple apps with a single login, streamlining the login process and reducing reliance on multiple authentication methods, making it more difficult for attackers to gain access. However, this creates a single point of failure whereby if the SSO system is compromised, attackers can gain access to all apps a user can access through SSO. Hence, implement SSO with MFA for a robust security posture.\n\nNext, Passkeys offer a modern alternative to traditional passwords. Passkeys simplify authentication while adhering to 2FA by combining PIN or biometrics with a possession-based factor like a device or security token. Passkeys can be set up in synchronised mode or device-bound.\n\nLastly, consider the difference between first-party and third-party authentication. First-party authentication involves developers building and maintaining the method themselves. While this grants more control and customisation, it can be time-consuming and expensive. On the other hand, third-party authentication involves using pre-built methods from another established company. While they can be integrated quickly and offer regular security patches, developers will have less control and customisation over such authentication methods."
							}
						],
						"links": [
							{
								"href": "#1a72abac-4824-4f98-969a-c3038a18e8ae",
								"text": "MASVS-AUTH-1, MASVS-AUTH-3",
								"rel": "reference"
							},
							{
								"href": "#eb9103eb-0d3c-43c4-88e1-9798d6d35c4e",
								"text": "section(s) 9.1.5, 14.2.1",
								"rel": "reference"
							},
							{
								"href": "#55c60255-39b8-46dd-912e-7464fca5890a",
								"text": "section(s) 2.10",
								"rel": "reference"
							}
						]
					}
				]
			}
    ],
    "back-matter": {
			"resources": [
				{
					"uuid": "1a72abac-4824-4f98-969a-c3038a18e8ae",
					"title": "OWASP Mobile Application Security Verification Standard v2.1.0",
					"rlinks": [
						{
							"href": "https://github.com/OWASP/owasp-masvs/releases/latest/download/OWASP_MASVS.pdf"
						}
					] 
				},
				{
					"uuid": "eb9103eb-0d3c-43c4-88e1-9798d6d35c4e",
					"title": "MAS Technology Risk Management Guidelines (January 2021)",
					"rlinks": [
						{
							"href": "https://www.mas.gov.sg/-/media/MAS/Regulations-and-Financial-Stability/Regulatory-and-Supervisory-Framework/Risk-Management/TRM-Guidelines-18-January-2021.pdf"
						}
					] 
				},
				{
					"uuid": "55c60255-39b8-46dd-912e-7464fca5890a",
					"title": "ENISA Smartphone Secure Development Guidelines (December 2016)"
				}
			]
		}
  }
}